imp/build/docs/runtime/controllers/authentication/Authentication.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-06 Thu 16:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Authentication Function for App</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Atreyee" />
<link rel="stylesheet" type="text/css" href="./style/css/worg-style.css" />
<link rel="stylesheet" type="text/css" href="./style/css/override.css" />
<link rel="icon" type="image/png" href="./style/img/favicon/popl.png" />


</head>
<body>
<div id="content">
<h1 class="title">Authentication Function for App</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6227c31">1. Introduction</a>
<ul>
<li><a href="#org7d89684">1.1. Session</a></li>
<li><a href="#orgf89fba8">1.2. Login</a></li>
<li><a href="#org4c3e294">1.3. Logout</a></li>
<li><a href="#orgd440d02">1.4. Initialisation</a></li>
<li><a href="#org9a7bee1">1.5. Authentication</a>
<ul>
<li><a href="#orgf7015c8">1.5.1. Admin Auth</a></li>
<li><a href="#org768f39f">1.5.2. Login Auth</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org578dfa2">2. Language Extensions and Imports</a></li>
<li><a href="#org362b51f">3. Utility Functions</a></li>
<li><a href="#orga9823b0">4. Authentication Handlers</a></li>
<li><a href="#org4585814">5. Tangling</a></li>
</ul>
</div>
</div>


<div id="outline-container-org6227c31" class="outline-2">
<h2 id="org6227c31"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Authentication is implemented using sessions and cookie-based authentication.
</p>
</div>

<div id="outline-container-org7d89684" class="outline-3">
<h3 id="org7d89684"><span class="section-number-3">1.1</span> Session</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A value of type <code>Session</code> is stored in the database for each user logged in.
</p>

<p>
<code>Session</code> type has the following properties :
</p>

<dl class="org-dl">
<dt>SessionUserId</dt><dd>Id of the user corresponding to the session</dd>
<dt>SessionUserEmail</dt><dd>Email of the logged-in user</dd>
<dt>SessionUserRoles </dt><dd>Role of the logged-in user</dd>
<dt>SessionId       </dt><dd>Id of the session, which is passed as a cookie to the client.</dd>
</dl>
</div>
</div>


<div id="outline-container-orgf89fba8" class="outline-3">
<h3 id="orgf89fba8"><span class="section-number-3">1.2</span> Login</h3>
<div class="outline-text-3" id="text-1-2">
<p>
A value of type <code>Session</code> is created and stored in the database upon login. A
cookie corresponding to the newly-created session is sent to the client.
</p>
</div>
</div>
<div id="outline-container-org4c3e294" class="outline-3">
<h3 id="org4c3e294"><span class="section-number-3">1.3</span> Logout</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The session corresponding to the logged-in user is deleted from the database
upon logout.
</p>
</div>
</div>
<div id="outline-container-orgd440d02" class="outline-3">
<h3 id="orgd440d02"><span class="section-number-3">1.4</span> Initialisation</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Upon initialisation, all sessions in the database are deleted, if any.
</p>
</div>
</div>
<div id="outline-container-org9a7bee1" class="outline-3">
<h3 id="org9a7bee1"><span class="section-number-3">1.5</span> Authentication</h3>
<div class="outline-text-3" id="text-1-5">
<p>
For routes that need authentication, a value of type <code>Int</code> - that corresponds
to the <code>SessionId</code> of the current session- is passed as header.
</p>
</div>

<div id="outline-container-orgf7015c8" class="outline-4">
<h4 id="orgf7015c8"><span class="section-number-4">1.5.1</span> Admin Auth</h4>
<div class="outline-text-4" id="text-1-5-1">
<dl class="org-dl">
<dt>Usage</dt><dd>Used to verify if logged-in user has role admin.</dd>
<dt>Procedure</dt><dd>check if session with <code>SessionId = authVal</code> has role
<code>Admin</code>.</dd>
<dt>Function</dt><dd><code>adminAuthCheck</code></dd>
</dl>
</div>
</div>

<div id="outline-container-org768f39f" class="outline-4">
<h4 id="org768f39f"><span class="section-number-4">1.5.2</span> Login Auth</h4>
<div class="outline-text-4" id="text-1-5-2">
<dl class="org-dl">
<dt>Usage</dt><dd>Used to verify if user is logged in.</dd>
<dt>Procedure</dt><dd>check if session with <code>SessionId = authVal</code> exists in the
database.</dd>
<dt>Function</dt><dd><code>authCheck</code></dd>
</dl>
</div>
</div>
</div>
</div>
<div id="outline-container-org578dfa2" class="outline-2">
<h2 id="org578dfa2"><span class="section-number-2">2</span> Language Extensions and Imports</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-haskell" id="org44fb3ff">{-# LANGUAGE DataKinds         #-}
{-# LANGUAGE DeriveGeneric     #-}
{-# LANGUAGE LambdaCase        #-}
{-# LANGUAGE OverloadedStrings #-}
{-# LANGUAGE TypeFamilies      #-}
{-# LANGUAGE TypeOperators     #-}

module Authentication where

import           Control.Monad.IO.Class
import           Control.Monad.Logger (runStderrLoggingT)

import           Data.String.Conversions
import qualified Data.ByteString.Lazy.Char8 as B           

import           Database.Persist
import           Database.Persist.Sql
import           Database.Persist.Sqlite

import           Network.Wai
import           Network.Wai.Handler.Warp as Warp

import           Servant

import           Data.Text

import           Api
import           Models
import           Role
</pre>
</div>
</div>
</div>

<div id="outline-container-org362b51f" class="outline-2">
<h2 id="org362b51f"><span class="section-number-2">3</span> Utility Functions</h2>
<div class="outline-text-2" id="text-3">
<p>
These are utility functions to be used in implementing authentication-related
tasks.
</p>

<p>
The following function takes a value of type <code>String</code> and returns an equivalent
value of type <code>Int</code>. This is used to convert URL values to something that can
be used as a Sql key.
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="org92385a0">toInt :: String -&gt; Int
toInt str = read str
</pre>
</div>

<p>
The following function takes a value of type <code>String</code> and converts it to a
value of type <code>SessionId</code>. This is used to convert a cookie (that represents
the session-ID of a logged-in user) to a <code>SessionId</code> value.
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="orgb118b40">toSessionId :: String -&gt; SessionId
toSessionId val = toSqlKey $ fromIntegral $ toInt val
</pre>
</div>

<p>
The following function checks if a required header value is present or not.
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="orgbe9a5ce">headerCheck :: Maybe String -&gt; String
headerCheck authVal = case authVal of
    Nothing -&gt; "0"
    Just value -&gt; value
</pre>
</div>
</div>
</div>

<div id="outline-container-orga9823b0" class="outline-2">
<h2 id="orga9823b0"><span class="section-number-2">4</span> Authentication Handlers</h2>
<div class="outline-text-2" id="text-4">
<p>
The functions for returning authentication status (True/False).
</p>


<p>
To check whether the user being logged in with a given <code>Role</code> has that role
belonging to said user:
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="orgb5efd2d">hasRole :: ConnectionPool -&gt; Session -&gt; IO (Bool)
hasRole pool session = flip runSqlPersistMPool pool $ do
  user &lt;- selectFirst [UserEmail ==. (sessionUserEmail session)] []
  case user of
    Nothing -&gt; return False
    Just xs -&gt; let
                 roles = userRoles $ entityVal xs
                 sessionRole = Prelude.head (sessionUserRoles session)
               in
                 if (sessionRole `elem` roles)
                 then return True
                 else return False
</pre>
</div>

<p>
To check whether an user is logged-in - i.e: whether the session passed by the
user is in <code>Session</code> database:
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="org83a9f04">loginCheck :: ConnectionPool -&gt; String -&gt; IO Bool
loginCheck pool authSessionId = flip runSqlPersistMPool pool $ do
  isLoggedIn &lt;- get $ toSessionId authSessionId
  case isLoggedIn of
    Nothing -&gt; return False
    Just _ -&gt; return True
</pre>
</div>


<p>
To check whether a user is logged-in with <code>Admin</code> role:
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="org4a49116">adminAuthCheck :: ConnectionPool -&gt; String -&gt; IO Bool
adminAuthCheck pool authSessionId = flip runSqlPersistMPool pool $ do
  roleOfLoggedInUser &lt;- get $ toSessionId authSessionId
  case roleOfLoggedInUser of
    Nothing -&gt; return False
    Just roleValue -&gt; case (sessionUserRoles roleValue) of  
                        [NonAdmin] -&gt; return False
                        [Admin]    -&gt; return True
</pre>
</div>


<p>
To check if logged-in user is the same as user passed to the function:
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="orgc5f9cd9">isSelfCheck :: ConnectionPool -&gt; String -&gt; String -&gt; IO Bool
isSelfCheck pool userData authSessionId = flip runSqlPersistMPool pool $ do
  roleOfLoggedInUser &lt;- get $ toSessionId authSessionId
  case roleOfLoggedInUser of
    Nothing -&gt; return False
    Just roleValue -&gt; if (((sessionUserEmail roleValue) == userData))
                        then return True
                        else return False
</pre>
</div>


<p>
To check if logged-in user either has <code>Admin</code> role or is same as user passed to
the function:
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="org0be45c1">isEitherAdminOrSelfCheck :: ConnectionPool -&gt; String -&gt; String -&gt; IO Bool
isEitherAdminOrSelfCheck pool userData authSessionId = flip runSqlPersistMPool pool $ do
  roleOfUser &lt;- get $ toSessionId authSessionId
  case roleOfUser of
    Nothing -&gt; return False
    Just xs -&gt; case (sessionUserRoles xs) of
      [Admin] -&gt; return True
      [NonAdmin] -&gt; if ((sessionUserEmail xs) == userData) 
        then return True
        else do
          userEntity &lt;- selectFirst [UserEmail ==. (sessionUserEmail xs)] []
          case (entityVal &lt;$&gt; userEntity) of
            Nothing -&gt; return False
            Just x -&gt; if ((userName x) == userData)
                      then return True
                      else return False
</pre>
</div>


<p>
To check if logged-in user has <code>Admin</code> role and is not the same as user passed
to the function:
</p>

<div class="org-src-container">
<pre class="src src-haskell" id="org2312ed0">isNotAdminSelfCheck :: ConnectionPool -&gt; Text -&gt; String -&gt; IO Bool
isNotAdminSelfCheck pool userData authSessionId = flip runSqlPersistMPool pool $ do
  roleOfLoggedInUser &lt;- get $ toSessionId authSessionId
  case roleOfLoggedInUser of
    Nothing -&gt; return False
    Just roleValue -&gt; case (sessionUserRoles roleValue) of
                        [NonAdmin] -&gt; return False
                        [Admin] -&gt; if ((sessionUserEmail roleValue) == unpack(userData))
                                   then return False
                                   else return True
</pre>
</div>
</div>
</div>

<div id="outline-container-org4585814" class="outline-2">
<h2 id="org4585814"><span class="section-number-2">5</span> Tangling</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-haskell" id="org8f2fb0b">&lt;&lt;extns_and_imports&gt;&gt;
&lt;&lt;to_int&gt;&gt;
&lt;&lt;to_session_id&gt;&gt;
&lt;&lt;header_check&gt;&gt;
&lt;&lt;login_check&gt;&gt;
&lt;&lt;admin_auth_check&gt;&gt;
&lt;&lt;is_self_check&gt;&gt;
&lt;&lt;is_either_admin_or_self_check&gt;&gt;
&lt;&lt;is_not_admin_self_check&gt;&gt;
&lt;&lt;has_role_check&gt;&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Atreyee</p>
<p class="date">Created: 2017-07-06 Thu 16:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
